# GetExportLineweightTable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DGNExportOptions..::..GetExportLineweightTable Method
DGNExportOptions Class See Also
---
Gets a copy of the line weight table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportLineweightTable GetExportLineweightTable()
```

Visual Basic
---
```text
Public Function GetExportLineweightTable As ExportLineweightTable
```

Visual C++
---
```text
public:
ExportLineweightTable^ GetExportLineweightTable()
```

# ### Return Value
The line weight table.
# See Also
DGNExportOptions Class
Autodesk.Revit.DB Namespace